[{"content":"hadf","href":"//localhost:1313/posts/failure/","kind":"page","lang":"en","lastmod":"2024-11-22T10:32:39+05:30","objectID":"f162869a5f9fce3ee31259e1f5749ea0","publishDate":"2024-11-22T10:32:39+05:30","section":"posts","tags":[],"title":"Failure","type":"posts"},{"content":"Context is king. The essence of learning anything new comes to context. Context is king. Contextualizing a subject is the way you can relate the subject or information presented to you as a method of learning it deeply.\nIf you wanted to convert any highly boring and theoretical information into that which is easier for you to understand and process, and retain it over a long period of time, then the idea is to put it into different contexts.\nThis results in a higher yield where I quantify yield:\nQuality of connections in the brain Quantity of connections in the brain Retention of information Application of information under various contexts Quality of connections as a metric In the above picture, I mean to showcase that the higher and deeper quality of questioning you ask to the information, the better you can learn that information. I mean to discuss how higher quality reasoning results in better retention of the information. It\u0026rsquo;s fundamentally tied to a process known as Deep Processing.\nIts the inhernet cognitive ability to comprehend any information presented from a higher order rather than lower order level of thinking. Let me explain. The principle is that, if instead of looking at a piece of information and going - \u0026ldquo;I don\u0026rsquo;t understand what they are saying, let me read it again.\u0026rdquo; or \u0026ldquo;I don\u0026rsquo;t understand what they are saying, let me just memorize it.\u0026rdquo;\nYou instead practice deep processing which are as follows:\nWhat are the first principles of the information provided (you need not understand this) How is this information relevant to my current context? The problem I am trying to solve The theory I am trying to understand The idea I am trying to formulate The analysis I am trying to evaluate Can I apply this information to a different scenario or can I encounter this information being used in different ways in the same scenraio. This could be using a math formula to sovle 4 different classifications of the same nature of problems (applying the basic integral patterns by inducing it i.e. multiplying and dividing by some component to force the pattern to occur). Or, it could be applying a physics concept to 4 different concepts altogether (applying conservation of energy in momentum problems). If you are unable to relate, the induce. Create a hypothetical scenario where this information could become useful in the future. This technique is really effective at captivating your underlying cognitive processes to make the information more relevant and contextualized.\nQuantity of connections as a metric. So the image basically describes that the number of connections you make is really equivalently dependent on the quality of questions you\u0026rsquo;re asking. Lower quality questions don\u0026rsquo;t yield more information, but the highest quality of questioning yields a very high number of connections.\nIt\u0026rsquo;s fairly simplistic, you learn more from asking deeper questions!\nRetention of Information as a metric. The image describes the parallels between the Ebbinghaus Forgetting Curve and the Contextualized Recall curve. There\u0026rsquo;s no such thing as contextualized recall, its a term I am coining used to describe how infomration accquisition through Interleaved Retrieval and Chain-of-Thought with Contextualization is a better methodology to increase information retention.\nThe Y-Axis describes recall which, in this context, I refer to the amount of information that actually does exist in your brain and can be recalled. The graph suggests that over time, the number of connections slowly deteriorates, and this is true, we can apply the simple logic of Use it or Lose it.\nBut ultimately, information learnt like that is information learnt in isolation and decontextualized. This is dangerous because you end up forming isolated chunks of memory that only fire in a very specific scenario, such as a sequence of operations you do to solve a problem like following a recipe. Most people forget recipes which is why recipebooks exists.\nBut the best chefs reason from first principles, they don\u0026rsquo;t need cookbooks or recipebooks, they understand how flavours blend together, how to alter the flavour to different pallates. An example is how most of North Indian cooking uses a very basic Tomato, Onion, Garlic paste as a base, and then they alter the spices, min-max it and bring together different gravies.\nThe best chefs understand how certain principles (by principles I mean ingredients, components of a meal, spice levels, bases / sauces) interact in different contexts, and that\u0026rsquo;s what seperates a homecook from a chef.\nRajma, Chole, Aloo Matar, Dal Makhani, Paneer Butter Masala all use the same base. But I haven\u0026rsquo;t listed all because, well, I can\u0026rsquo;t, it\u0026rsquo;s too big.\nSo, understand the underlying patterns and don\u0026rsquo;t focus too much on the details, develop a schema of how the context works, and you can work from there onwards. What do I mean by schema? In knowledge theory, schema is best described in this video by Dr. Justin Sung.\nTransfer of Knowledge as a metric. We have come to the final section of this article. Knowledge Transfer. Knoweldge Transfer is that part of cognitive psychology that has been researched pretty poorly. Knowledge Transfer is the inherent ability to take information and apply it in different contexts, which is the heart of what this entire article aims to talk about.\nTraditional eductaion sucks at Knowledge Transfer. It\u0026rsquo;s pretty obvious why though.\nTraditional education focuses on \u0026ldquo;teaching\u0026rdquo; you:\nA very dumb and passive way of remembering and regurgitating a specific sequence of steps for a problem or test that is timed, therefore your priority isn\u0026rsquo;t how well you\u0026rsquo;ve learned the information, rather how quickly can you apply it to solve a problem. This is a disaster.\nThe core of problem-solving is patter recognition, sure, but the patterns emerge through some level of deep processing. School mostly trains you to memorize the patterns (here patterns also refer to the sequence of steps and operatinos to do to solve a problem) and well, apply them. This is observable to a great extent in competitive exams like the Gaokao and JEE.\nWell sure, your students end up learning a massive repository of patterns and problem solving strategies. But given a novel problem, has your education prepared you to solve it?\nThe immediate response to a novel problem is, is there an existing solution for this or not? If so, just look at how that\u0026rsquo;s been decomposed, memorize the pattern, apply it to a 1000 problems and move on. Well then, what have you achieved? This is literally rote memorization. You did not do any attempt in:\nProblem Decomposition Apply patterns to existing sub-problems. Hypothesize a solution to new sub-problems. Incrementally test your solution, if it fails try something new. Learn from your results and adapt your solution. Create deductive and inductive reasoning. Understand the constraints of the problem, thereby learning which contexts this solution can be applicable to. This is what education fails to do, and I mean, I can\u0026rsquo;t really blame it. In today\u0026rsquo;s world, teaching this is far far more difficult for teachers and professors than it is to solve 200 problems in a particular topic and moving on.\nBut, there\u0026rsquo;s a point in a Scientist\u0026rsquo;s, Engineer\u0026rsquo;s, Doctor\u0026rsquo;s life where they realise that this education did not teach them how to think.\nHere\u0026rsquo;s what you do, if you\u0026rsquo;re prepraing for an exam, with the way the system is set up, it rewards rote-learning and regurgitation. So forget the exams, just memorize the patterns and move on.\nBut if you\u0026rsquo;re learning for yourself, then teach yourself to take the information given to you and apply it in different contexts, examine the constraints of the context and the information, figure out why it works here and not somewhere else.\nThe ability to understand how to arrive at a solution given a novel problem, and apply that solution to different contexts whether it be in STEM or Non-STEM disciplines is the heart of contextualization.","href":"//localhost:1313/posts/contextualize/","kind":"page","lang":"en","lastmod":"2024-11-03T15:02:27Z","objectID":"581942f1b800443081617f657121db82","publishDate":"2024-11-03T15:02:27Z","section":"posts","tags":["academics","research","theories","learning"],"title":"Contextualize","type":"posts"},{"content":"Relevance is the most important factor in directing your learning.\nThis is a theory I have been cooking up for about the past three days. The entire premise is that without relevance, it\u0026rsquo;s entirely impossible to learn effectively, let alone learn.\nSo let\u0026rsquo;s define relevance within this context.\nRelevance Relevance is essentially the metadata attached to your present learning situation. Metadata describes how the data is structured, what it contains and how it\u0026rsquo;s used. This is from the perspective of computing.\nIn learning, I define Metadata as Relevance:\nWhat are you learning this information for? Is this information immediately relevant to a situation in the near future? If not, is it relevant to a situation in the distant future? Could this information, in theory, become relevant in a situation that\u0026rsquo;s immediate? How can you make this information directly relevant to your task at hand? This is essence of the information this article presents, but you can read further to get a clearer picture.\nRelevance in Learning Let\u0026rsquo;s say there are guests coming over to your house in 1 week. Your house is incredibly dirty, and you want to clean it up. You have a lot of clothes on the floor. You want to take them out and put them in a washing machine. But, you put it off, like most of us, until the very last day. Why?\nIt\u0026rsquo;s simple. You have an entire week to clean up? Might as well do it later, right?\nThis is effectively the same situation you encounter when learning something new, if it doesn\u0026rsquo;t directly concern your immediate situation, you don\u0026rsquo;t have to deal with it, therefore you forget the information and also equivalently don\u0026rsquo;t learn / encode it.\nIf you flip the situation and say, you have guests coming over to your house tomorrow? then it\u0026rsquo;s a whole different ball game, you rush and stumble and do anything you can to clean up your house.\nThis is why learning takes time. You have to learn to deal with situations that are not immediately relevant to you. This is the reason why we need to practice, in order to be able to learn.\nSo, how do you make information relevant?\nLuckily, you don\u0026rsquo;t have to worry guests In the situation of the guests, let\u0026rsquo;s add in a couple more variables:\nTheir ticket to your area get\u0026rsquo;s preponed, whether it be flight, bus, train or any other mode of transportation. They are not just coming over to you, they are also bringing their belongings with them. They plan to bring some of their own friends within your vicinity over to your house. You don\u0026rsquo;t have any nice clothes to wear, I mean, you gotta dress to impress, or atleast be presentable to your guests right? Now, do you feel like you gotta clean up your house?\nThat\u0026rsquo;s precisely it. If you observed what I just did there, I just made the task of cleaning up your house wayyyy more relevant than before. You have a lot of things to do. You have to deal with all these situations. It\u0026rsquo;l take time.\nTechniques to increase relevancy It should be fairly self-explanatory except for - \u0026ldquo;Understand the task as a factor of application\u0026rdquo;\nBy this I mean, try to understand this information as a theoretical situation which can arise and you\u0026rsquo;d need to know this to solve it.\nFor example, knowledge of Linked Lists from a theoretical standpoint is boring. Like, why in linked lists, there\u0026rsquo;s a head pointer? What\u0026rsquo;s the point of having a head pointer? Why not just have a head node and call it a day?\nWell, you could just put off the task like that, but to make it more relevant, try to understand the situation as a theoretical one. Try to solve it using the knowledge you have or will accquire.\nIf you\u0026rsquo;re creating a head node, then if you plan on accessing the head node\u0026rsquo;s value, you will need a pointer to it, otherwise, with the way C handles memory, you can\u0026rsquo;t just access nothing? If that makes sense.\nNow to make this concept more relevant to a real world scenario, where you could encounter it.\nIn databases, if you\u0026rsquo;re trying to add more tables into the database, but you don\u0026rsquo;t have a head pointer, you literally have compromised your entire data\u0026rsquo;s integrity.\nThis is not a great example, I understand, but I hope you\u0026rsquo;re left with the essence of what I am telling.\nIf the information you\u0026rsquo;re studying is not easily digestible, it\u0026rsquo;s because it\u0026rsquo;s not relevant to your situation. Relevancy can be many things like - Not relevant to your time, not relevant to your knowledge, not relevant to your course, not relevant to your goals, not relevant to even your current subject.\nTherefore, the way to direct your learning and potentially make it 10x faster is to make it more relevant.\nIf for example you\u0026rsquo;re studying a subject and you have no idea how the exam for it is gonna be. As a result, you kinda just skim through, write some notes and pretend that it\u0026rsquo;s gonna be all okay.\nThis is a disaster.\nYou have effectively avoided the situation wherein the exam is insanely difficult and you didn\u0026rsquo;t predict it, which cost you your scores.\nTo make your learning / studying more relevant, look at textbook, look at exercises, look at practice papers, look at other university\u0026rsquo;ss notes, other college\u0026rsquo;s exams.\nFind ways to make your study / learning session as a discrete set of tasks that are clearly defined with solutions. That way you can actually learn.","href":"//localhost:1313/posts/relevance/","kind":"page","lang":"en","lastmod":"2024-10-21T17:02:40+05:30","objectID":"12db2f06c8d5e13bd7f2c2f82c8d6513","publishDate":"2024-10-21T17:02:40+05:30","section":"posts","tags":["academics","research","theories","learning"],"title":"Relevance","type":"posts"},{"content":"hello\nSection 1 Section 2 Section 3 Section 2 Section 2.1 Section 2.3","href":"//localhost:1313/notes/test/","kind":"page","lang":"en","lastmod":"2024-10-11T19:24:25+05:30","objectID":"28e806c49dbea4476046c1c4ad608d7e","publishDate":"2024-10-11T19:24:25+05:30","section":"notes","tags":[],"title":"Test","type":"notes"},{"content":"Mandelbrot Set","href":"//localhost:1313/synthesis/mandelbrot/","kind":"page","lang":"en","lastmod":"2024-10-08T22:09:18+05:30","objectID":"3f7c7311f976539244edf976067e58a7","publishDate":"2024-10-08T22:09:18+05:30","section":"synthesis","tags":[],"title":"Mandelbrot","type":"synthesis"},{"content":"Rendering of Conway\u0026rsquo;s Game of Life Table of Contents Cellular Automata Conway\u0026rsquo;s game of life Rules Implementation Shortcomings Cellular Automata Cellular Automata is a field of computer science dealing with modelling certain systems by dividng a space into a grid of cells, each cell can take upon a finite number of states. The states are then influenced and modified according to a set of rules which similarly influence neighbouring cells.\nVery simply put, its a box of cells, that can take a state and are influenced / can influence their neighbours based on a set of rules.\nConway\u0026rsquo;s game of life The game of life is a cellular automaton invented by John Horton Conway in 1970. It\u0026rsquo;s most famously known as a zero player game. It\u0026rsquo;s a fancy way of saying that the game\u0026rsquo;s progression depends on an initial state, and that\u0026rsquo;s it, no other factors / players / events influence it a.k.a automata.\nRules The Rules are simple:\nAny live cell with fewer than two live neighbours dies (underpopulation). Any live cell with more than three live neighbours dies (overcrowding). Any dead cell with exactly three live neighbours becomes a live cell (reproduction). Any other state remains unchanged (stasis). Implementation Very roughly the pseudocode can be written as so:\nInitialization: Set up a 2D grid with alive or dead cells. Start with an initial pattern. Main Loop: For each cell: Count neighbors. Apply rules: Dies (under/overpopulation). Becomes alive (reproduction). Stays alive (survival). Record changes. Apply changes and redraw changed cells. Repeat until stopped or stable. I have written the C++ code with a graphics library implementation using SFML here. Also, if you\u0026rsquo;re already visiting, kindly make sure to check out my other projects within the same repository! Thanks.\nShortcomings The code works, but there’s room for improvement. First, use double buffering to avoid in-place updates affecting neighboring cells during the same generation. Second, optimize neighbor calculation—it’s repetitive and slow for larger grids. Precomputing or caching neighbor positions would help. Third, preallocate the generation vector to avoid frequent resizing, which slows things down. Lastly, avoid creating new rectangles on every frame; instead, store them and just update colors. These changes would significantly improve both correctness and performance.","href":"//localhost:1313/synthesis/game_of_life/","kind":"page","lang":"en","lastmod":"2024-10-08T20:08:38+05:30","objectID":"5c25d4be6b2417b5367a8bbc8a1ff109","publishDate":"2024-10-08T20:08:38+05:30","section":"synthesis","tags":["programming","mathematics","cellular automata","computing"],"title":"The Game of Life","type":"synthesis"},{"content":"Distractions. Cut the distractions, or so I yearn to do, and yet I fail miserably, only to get distracted by something else and well, repeat this again.\nI just finished my Cryptography test, absolutely nailed it, no regrets whatsoever. Finished the exam in half the time required. To be fair though, the questions weren\u0026rsquo;t inherently difficult to begin with, and I was in reality just solving based on pure muscle memory.\nAnyways, onto the topic at hand, distractions. See what I did there? I got distracted as I was writing this.\nI don\u0026rsquo;t know why, but I am not able to focus for tomorrow\u0026rsquo;s test - Software Project Management. On the surface it doesn\u0026rsquo;t seem to be that challenging but I don\u0026rsquo;t want to keep my hopes up high, it could end up being incredibly difficult as the questions are quite open ended.\nI am not sure what to do with this subject, I am probably going to get cooked not going to lie.\nIt\u0026rsquo;s incredible to me how the human brain just actively refuses to store information no matter how hard or relevant the information may be, probably an evolutionary mechanism to prevent storing unnecessary information.\nMy mind kept wandering, and it was quite the annoyance. Here I am, in two minds, study and adapt to tomorrow\u0026rsquo;s circumstances or get distracted and flunk and my brain is choosing the latter.\nEvolution really did us dirty. Atleast for me, in this specific situation and many such occasions which will inevitably arise in the future.\nI should figure something out\u0026hellip;\nWhat is the best way to streamline your thoughts into action, and towards the goal of the examination?\nBear with me for a second, I am thinking out loud.\nWell yesterday, it was the apparent scariness of the information that I was studying, and that kinda lit a fire up my ass.\nNot this time though, this strategy probably will not work because my brain is looking at the study materials and going - \u0026ldquo;Eh, seems easy enough. I should really start watching the next episode of Link Click.\u0026rdquo; or \u0026ldquo;This weekend right after my tests are over is gonna be inanse, I wonder what I should be doing?\u0026rdquo;\nI am not sure if this is a good strategy to follow.\nAlright, I gotta go figure something out or I am actually cooked. Peace.","href":"//localhost:1313/posts/distraction/","kind":"page","lang":"en","lastmod":"2024-09-24T22:02:19+05:30","objectID":"89a2a632b4d511fd7852c5ec5a240417","publishDate":"2024-09-24T22:02:19+05:30","section":"posts","tags":["Life","Productivity","Work","Meaning","Education"],"title":"Distraction","type":"posts"},{"content":"Ah, yes, Management. The epitome of corporate circle-jerking and unnecessary corporate bureaucracy, nevertheless the most important part of any corporate structure or enterprise. And as a result of it\u0026rsquo;s significance, it taught in some form or sense in university.\nI just finished my Mid-Semester examination for the course - \u0026ldquo;Essentials of Management\u0026rdquo;. It was alright, except for one question that completely threw me on a curveball.\nThe question, as far as I can recall goes something like this:\nMr. X was involved in an organization that manufactures food products, he has a degree in the food manufacturing process and was dissatisfied in his current capcity. So he quit and established a new manufacturing unit for the same. He sets Mr. Y to set up the entire process and production system. Mr. X plans to handle the marketting part through his private outlets. Mr. Y also has to bring in certain sales expectations to Mr. X by the end of the quarter. The raw materials will be sourced by the organic farmers in a line of credit and will fund the first three months of the business. Mr. Y also plans to punish and penalise employees who don\u0026rsquo;t wear gloves during the production process. Identify the 4 types of plans that will be employed during this process.\nSeems easy enough, right? But I was completely wrong with my thought process and this is the core problem behind Management problems presented to you in examinations, atleas in India, where I am from.\nThe question asked for a list of plans that will be employed during the production process. The first thing that came to mind was a cost-benefit analysis. But then I thought that there might be some other kind of plan that would be more appropriate, so I started thinking about things like:\nFinancial Planning Sales Planning Strategy Planning So I figured that the question was looking for a list of plans, and I wrote down the 4 plans which I thought were applicable, after all they are asking the types of plans\nThis was my first and most detrimental mistake.\nOne look at my study material and you will find that apparently the types of plans are in fact:\nMission Vision Strategy Goals Objectives This is the type of absolute bullshit pulled by management, the lingo used doesn\u0026rsquo;t make sense whatsoever but oh well. It\u0026rsquo;s incredible how they are using the words \u0026ldquo;plan\u0026rdquo; and \u0026ldquo;strategy\u0026rdquo; interchangeably. If the question was rather about strategy or drawing out / sketching out a strategic plan I would have written about what they required.\nAnyways, I should stop the rant. I\u0026rsquo;m going to start preparing for my cryptography test tomorrow, it\u0026rsquo;s fairly technical and I\u0026rsquo;m pretty sure they won\u0026rsquo;t drop in any tongue twisters like this test did.","href":"//localhost:1313/posts/management/","kind":"page","lang":"en","lastmod":"2024-09-23T15:48:55+05:30","objectID":"277a2024429480d8a9ac7893b81f178e","publishDate":"2024-09-23T15:48:55+05:30","section":"posts","tags":["Management","University","Education","Examination"],"title":"Management","type":"posts"},{"content":"Becoming a polymath is easy, actually. For the longest time, I\u0026rsquo;ve caught myself wondering - \u0026ldquo;Shouldn\u0026rsquo;t it be possible to become specialised in any and every skill there is available since the advent of the search engine?\u0026rdquo; The search engine is the ultimate querying machine, with the expanse of knowledge covering some of the best minds in the world, all provided to you with the only pre-requisite of:\nHaving an internet connection A personal computer Yet, interestingly enough, I believe from my personal observations, that the exact opposite scenario is taking place, wherein we have people that have access to both the aforementioned prerequisite tech, but lack any and all ability to capture and transfer any information to any domain. Let me expand.\nThe world as we know it, at a very atomic level, functions transactionally. Any and all interaction is a transaction of some sort, so one would assume that with access to the internet, and search engines that deliver information at literally a millionth of a second, that humans would be able to equivalently acquire and disseminate new information and theories, i.e. a transaction.\nYeah this isn\u0026rsquo;t happening in my experience.\nWhat stopped researchers and scientists in the 20th century from advancing science? Acquisition of Information and Knowledge. Any and every theoretical or practical forthcomings presented by scientists requires a fundamental and depth-first understanding of several schema of knowledge tied together.\nRead that line again. And again, until you understand it.\nThe brain is essentially an ultra-threaded parallel processing computer that hosts a massive corpus of information. While it\u0026rsquo;s not clear how the brain stores memories, several leading theories suggest:\nEvolutionarily speaking, emotions and fundamental instincts drive memory (like hunter-gatherer instincts). Repetition, neurons that fire together, wire together. However all these theories fail to address one thing, any scientific advancement since the 20th century was not fueled by emotion or repetition, you weren\u0026rsquo;t being held at gunpoint to learn calculus out of the fear of losing your life or to repeatedly solve calculus problems to find solutions to determine the rate of radioactive decay.\nThey solved it by, well, asking how do I solve this problem?\nAnd that\u0026rsquo;s it, that\u0026rsquo;s what\u0026rsquo;s lacking. Critical Thinking.\nThe ability to comprehend any and all information is, in my opinion, completely determined by whether you can ask the right questions. Here, right questions implies questions that allow you to comprehend. It\u0026rsquo;s recursive.\nThis is, inherently, a VERY complicated process. But, I believe this is the ideal way to perform scientific inquiry. Let\u0026rsquo;s divide and conquer the above graph to get a clear idea. The obvious part of course is, if it\u0026rsquo;s incomprehensible, as in, you can\u0026rsquo;t wrap your head around it, then it\u0026rsquo;s simply a problem of background knowledge. You lack the prerequisite formal knowledge to understand what it\u0026rsquo;s trying to suggest. You can fix this problem very quickly by simply asking yourself - \u0026ldquo;What don\u0026rsquo;t I understand? Why do I not understand it? What are the pieces that make up the idea and how do I understand them?\u0026rdquo;\nSeems simple enough right? Here\u0026rsquo;s the kicker, even if you understand the pieces, if you can\u0026rsquo;t understand it within the contextual setting, you won\u0026rsquo;t get anywhere. To question within context is the hardest process, gaining background knowledge is the easiest part.\nYou can do it though, and here comes two very important factors that influence the outcome of your current predicament.\nGrit Optimism I personally struggled with both, and I believe many people do, there\u0026rsquo;s a ceratin naivety required to understand the unknown, the belief that it is indeed comprehensible will completely eradicate any existing conflicting and confounding thought processes that perhaps, this endeavour was indeed futile and the result doesn\u0026rsquo;t exist.","href":"//localhost:1313/posts/polymath/","kind":"page","lang":"en","lastmod":"2024-09-21T17:41:43+05:30","objectID":"68c185cd8faa82b141046c7608b801d1","publishDate":"2024-09-21T17:41:43+05:30","section":"posts","tags":[],"title":"Polymath","type":"posts"}]